thulithwilfred/openBSD_kernel_work/a3/working_a3/pfexec/pfexec.1
.\" Copyright 2021, the University of Queensland
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.Dd $Mdocdate: October 1 2021 $
.Dt PFEXEC 1
.Os
.Sh NAME
.Nm pfexec
.Nd execute commands with elevated privileges
.Sh SYNOPSIS
.Nm pfexec
.Op Fl ns
.Op Fl u Ar user
.Ar command
.Op Ar args
.Sh DESCRIPTION
The
.Nm
utility executes commands with elevated privileges (as root or another user).
The
.Ar command
argument is mandatory unless
.Fl s
is specified.
.Pp
The user may be required to authenticate by entering their password on the
controlling terminal, depending on policy configuration.
.Pp
The daemon
.Xr pfexecd 8
manages policy for the system based on its configuration files. The
.Nm
utility requires
.Xr pfexecd 8
to be running in order for it to operate.
.Pp
The options are as follows:
.Bl -tag -width tenletters
.It Fl n
Non interactive mode, fail if the matching rule doesn't have the
.Ic nopass
option.
.It Fl s
Execute the shell from
.Ev SHELL
or
.Pa /etc/passwd .
.It Fl u Ar user
Execute the command as
.Ar user .
The default is root.
.El
.El
.Sh EXIT STATUS
.Ex -std pfexec
It may fail for one of the following reasons:
.Pp
.Bl -bullet -compact
.It
The
.Xr pfexecd 8
policy daemon is not running.
.It
The user attempted to run a command which is not permitted.
.It
The password was incorrect.
.It
The specified command was not found or is not executable.
.El
.Sh SEE ALSO
.Xr pfexecd 8 ,
.Xr pfexecd.conf 5 ,
.Xr doas 1
