thulithwilfred/openBSD_kernel_work/a3/working_a3/pfexecd/pfexecd.conf.5
.\" Copyright 2021, the University of Queensland
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.Dd $Mdocdate: October 1 2021 $
.Dt PFEXECD.CONF 5
.Os
.Sh NAME
.Nm pfexecd.conf
.Nd pfexecd configuration file
.Sh DESCRIPTION
The
.Nm
configuration file contains the policy to be applied by the
.Xr pfexecd 8
daemon.
.Pp
It consists of a series of rules, in a similar format to
.Xr doas.conf 5 .
.Pp
The rules have the following format:
.Bd -ragged -offset indent
.Ic permit Ns | Ns Ic deny
.Op Ar options
.Ar identity
.Op Ic as Ar target
.Op Ic cmd Ar command Op Ic args No ...
.Ed
Rules consist of the following parts:
.Bl -tag -width 11n
.It Ic permit Ns | Ns Ic deny
The action to be taken if this rule matches.
.It Ar options
Options are:
.Bl -tag -width keepenv
.It Ic nopass
The user is not required to enter a password.
.It Ic nolog
Do not log successful command execution to
.Xr syslogd 8 .
.It Ic persist
After the user successfully authenticates, do not ask for a password
again for some time.
.It Ic keepgroups
Keeps the group ID and group membership of the process calling
.Xr pfexecve 2
unchanged. By default, groups will be set to the target user's primary and
default groups.
.It Ic setgroups { Ar group Oo Ar group ... Oc Ic }
Overrides the group memberships of the new process, setting the primary group
to the first group specified, and additional group membership to the remaining
space-separated group names.
.It Ic keepenv
Environment variables other than those listed in
.Xr pfexec 1
are retained when creating the environment for the new process.
.It Ic setenv { Oo Ar variable ... Oc Oo Ar variable=value ... Oc Ic }
Keep or set the space-separated specified variables.
Variables may also be removed with a leading
.Sq -
or set using the latter syntax.
If the first character of
.Ar value
is a
.Ql $
then the value to be set is taken from the existing environment
variable of the indicated name.
This option is processed after the default environment has been created.
.It Ic chroot { Oo Ar path Oc Ic }
Changes the root directory (in a similar manner to
.Xr chroot 2 )
of the new process to the given path after loading the executable. If no path
is given, uses
.Em /var/empty .
The executable to be run does not have to exist within the chroot path.
.El
.It Ar identity
The username to match.
Groups may be specified by prepending a colon
.Pq Sq \&: .
Numeric IDs are also accepted.
.It Ic as Ar target
The target user the running user is allowed to run the command as.
The default is all users.
.It Ic cmd Ar command
The command the user is allowed or denied to run.
The default is all commands.
Be advised that it is best to specify absolute paths.
If a relative path is specified, only a restricted
.Ev PATH
will be searched.
.It Ic args Op Ar argument ...
Arguments to command.
The command arguments provided by the user need to match those specified.
The keyword
.Ic args
alone means that command must be run without any arguments.
.El
.Pp
The last matching rule determines the action taken.
If no rule matches, the action is denied.
.Pp
Comments can be put anywhere in the file using a hash mark
.Pq Sq # ,
and extend to the end of the current line.
.Pp
The following quoting rules apply:
.Bl -dash
.It
The text between a pair of double quotes
.Pq Sq \&"
is taken as is.
.It
The backslash character
.Pq Sq \e
escapes the next character, including new line characters, outside comments;
as a result, comments may not be extended over multiple lines.
.It
If quotes or backslashes are used in a word,
it is not considered a keyword.
.El
.Sh FILES
.Bl -tag -width /etc/pfexecd.conf -compact
.It Pa /etc/pfexecd.conf
.Xr pfexecd 8
configuration file.
.El
.Sh SEE ALSO
.Xr pfexec 1 ,
.Xr pfexecd 8 ,
.Xr doas.conf 5 ,
.Xr doas 1
