thulithwilfred/openBSD_kernel_work/a3/working_a3/pfexecd/pfexecd.8
.\" Copyright 2021, the University of Queensland
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.Dd $Mdocdate: October 1 2021 $
.Dt PFEXECD 8
.Os
.Sh NAME
.Nm pfexecd
.Nd pfexec policy daemon
.Sh SYNOPSIS
.Nm pfexecd
.Op Fl ft
.Op Fl c Ar file
.Sh DESCRIPTION
.Nm
is a daemon which makes policy decisions about whether to allow privilege
escalation by users of the
.Xr pfexec 1
tool and the
.Xr pfexecve 2
system call.
.Pp
Its main purpose is to listen for requests from the kernel, which contain
credential information about the process and user requesting escalation, and
then apply the policy specified in its configuration file,
.Xr pfexecd.conf 5 .
.Pp
When escalation is allowed by policy,
.Nm
informs the kernel of the final credentials to set for the process, including
the
.Em UID ,
.Em GID ,
.Em groups ,
and
.Em environment variables
that the new process should run with.
.Pp
When escalation is denied,
.Nm
specifies the
.Xr errno 2
error code value to be returned by
.Xr pfexecve 2 .
.Sh FILES
.Bl -tag -width "/var/run/pfexecd.sock" -compact
.It Pa /etc/pfexecd.conf
Default configuration file.
.It Pa /var/run/pfexecd.sock
.Ux Ns -domain
socket used for communication with the kernel via
.Xr pfexecve 2 .
.El
.Sh SEE ALSO
.Xr pfexec 1 ,
.Xr pfexecve 2 ,
.Xr pfexecd.conf 5 ,
.Xr doas 1
